                                            # Переменные
# int
# float
# str
# list - список
# set - не показывает одинаковые значения
# dict - словари
# bool - переменные с логическими значениями тру и фолс
#
#
# a = [1, 2, 'st3', 34, 12, 3, 4, 'a', 'b']
# a[-1] == a[8]
# a.append('ttttt') - добавляет в конец списка
# a.pop(-1)
# a.insert(1, 2)
# a.count(3)  - проход по списку и выведение количества "3"
# a.extend()  - добавляет в список с разбивкой
# a.remove(1)  - удаляет значение в скобках, если их несколько то удаляет только одно - первое
# a.reverse()   - переворачивает массив
# a.sort()    - сортировка от меньшего к большему
# a.__contains__()     - проверяет есть ли значение в скобках (элемент)
# a = set(1,2,3,4,5,6,7,7,4,3,2,1)
# my_dict = {
#         'key': 'value',
#         'sub_dict': {},
#         2: [1, 2, 3, 4],
#     }
# print(my_dict['key']) - по ключи находим все значения в словаре

# while - работает только пока условие истинно


# a = input("Андрей?").lower()
# if a == "да":
#     print("It's false")
# elif a == "нет":
#     print("Это правда")


# class mainkampf():
#     def __init__(self):
#         print('keylock')
#     def a(self):
#         self.ab = "serin"
#     def b(self):
#         self.n = {1,2,3,4,5,6,7,8}
# ren = mainkampf()
# ren.b()

# a = [1,2,3,55,44,33,10,20,30,40]
# c = 0
# for i in a:
#     if i % 5 == 3:
#         c+=1
# print(c)


# a = [1,12,13,14,15,16,21,23,24,25,21]
# b = [1,12,13,16,32,43,56]
# c = a + b
# print(c)
# # result =
# a = input("Какой метраж объекта? ").lower()
# b = input("Какой бюджет? ").lower()
# c = input("Какой срок? ").lower()
# d = input("Объект сдан? ").lower()






















